language/onvif/抓包/probe_request1

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns="http://www.w3.org/2003/05/soap-envelope">
	<Header>
		<wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
			uuid:f465f0a0-f30d-4953-a1a7-123edcc7081b
		</wsa:MessageID>
		<wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
			urn:schemas-xmlsoap-org:ws:2005:04:discovery
		</wsa:To>
		<wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
			http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe
		</wsa:Action>
	</Header>
	<Body>
		<Probe xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
		       xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
		       xmlns="http://schemas.xmlsoap.org/ws/2005/04/discovery">
			<Types>
				tds:Device
			</Types>
			<Scopes />
		</Probe>
	</Body>
</Envelope>




